#+title: Lens vs Vanilla Haskell

#+PROPERTY: header-args:haskell :session lensVsVanilla :results silent

This document assumes a globally installed lens. In nix that means:

#+begin_src nix
  packages = with pkgs; [
    # ...
    (haskellPackages.ghcWithPackages (pkgs: [pkgs.lens]))
    # ...
  ];
#+end_src

*** odd indices   
    
#+begin_src haskell
[2,4,1,5,3,6] & partsOf (traversed.indices odd) %~ reverse
#+end_src

#+RESULTS:
| 2 | 6 | 1 | 5 | 3 | 4 |

#+begin_src haskell
-- TODO it's pretty easy to get to the point of filtering the pieces you need to change, but then how do you merge them back?
filter (odd . fst) . zip [0..] $ [2,4,1,5,3,6]
#+end_src

#+RESULTS:
| 1 | 4 |
| 3 | 5 |
| 5 | 6 |


*** multiple (this would be hard to write an alternative to)
    
#+begin_src haskell
"00:00:00" & partsOf (itraversed.indices (>= 3). filtered (== '0')) .~ "1234"
#+end_src

#+RESULTS:
: 00:12:34


** 3.6 Virtual Fields 
   
#+begin_src haskell :results silent
data Temperature = Temperature { location :: String, celsius :: Float } deriving (Show, Generic)
#+end_src

#+begin_src haskell
Temperature "New York" 30 ^. #location
#+end_src

#+RESULTS:
: New York

